In [2]:
%matplotlib inline
%reload_ext autoreload
%autoreload 2

import pandas as pd
import numpy as np

from utils.explore import *

In [3]:
%ls data

h1b_kaggle.csv                 titanic-train.csv
titanic-gender-submission.csv  twolves-comments.csv
titanic-test.csv               uber/

In [29]:
tt_trn = pd.read_csv("data/titanic-train.csv")

In [30]:
tt_trn.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [32]:
del tt_trn["PassengerId"]
del tt_trn["Name"]
del tt_trn["Ticket"]

In [33]:
cabin_class = np.array([s[0] for s in tt_trn["Cabin"].astype(str)])
tt_trn["Cabin"] = pd.Categorical(cabin_class)

In [34]:
pd.crosstab(index=tt_trn["Cabin"], columns="count")

col_0  count
Cabin
A         15
B         47
C         59
D         33
E         32
F         13
G          4
T          1
n        687

In [35]:
show_qual(tt_trn)

Sex
        Count  Frequency
male      577  64.758698
female    314  35.241302

Embarked
   Count  Frequency
S    644  72.278339
C    168  18.855219
Q     77   8.641975

In [42]:
pd.crosstab(
    index=tt_trn["Survived"],
    columns=tt_trn["Pclass"],
    margins=True
)

Pclass      1    2    3  All
Survived
0          80   97  372  549
1         136   87  119  342
All       216  184  491  891

In [44]:
ct = pd.crosstab(
    index=tt_trn["Sex"],
    columns=tt_trn["Survived"],
    margins=True
)
ct / ct.loc["All", "All"]

Survived         0         1       All
Sex
female    0.090909  0.261504  0.352413
male      0.525253  0.122334  0.647587
All       0.616162  0.383838  1.000000

In [45]:
ct = pd.crosstab(
    index=tt_trn["Survived"],
    columns=[tt_trn["Pclass"], tt_trn["Sex"]],
    margins=True
)

In [46]:
ct

Pclass        1           2           3       All
Sex      female male female male female male
Survived
0             3   77      6   91     72  300  549
1            91   45     70   17     72   47  342
All          94  122     76  108    144  347  891

In [47]:
ct / ct.loc["All"]

Pclass           1                   2                3                 All
Sex         female      male    female      male female      male
Survived
0         0.031915  0.631148  0.078947  0.842593    0.5  0.864553  0.616162
1         0.968085  0.368852  0.921053  0.157407    0.5  0.135447  0.383838
All       1.000000  1.000000  1.000000  1.000000    1.0  1.000000  1.000000